[
  {
    "id": "bedroom-1",
    "scene": "bedroom",

    "title": {
      "pl": "Naprawdę wygodne łóżko Mopsika Rondelki",
      "en": "A very comfortable bedroom"
    },

    "text": {
      "pl": "Mopsik Rondelko obudził się po długim i satysfakcjonującym śnie, w którym bawił się na swoim przyjęciu urodzinowym. Dostał w prezencie gumowego kurczaka ze smaczkami w środku, a jego mama podała gościom tort o smaku suszonego mięsa. Kiedy otworzył oczy, poczuł, że coś jest nie tak. To nie mógł być jego pokój. Było mu zimno, nie ścianach nie świeciły fluorescencyjne gwiazdki, nie widział swojej kolekcji pogryzionych piłek tenisowych, które leżały zawsze na komodzie. Co jednak najgorsze, w pobliżu czuło się czyjąś obecność...",
      "en": ""
    },

    "actions": [
      {
        "type": "link",
        "label": "Mopsik postanawia zbadać sprawę",
        "saveInputAs": "",
        "linksTo": "bedroom-2"
      }
    ]
  },

  {
    "id": "bedroom-2",
    "scene": "bedroom",

    "title": {
      "pl": "Mopsik postanawia zbadać sprawę",
      "en": ""
    },

    "text": {
      "pl": "Zanim Mopsik wstał ze swojego naprawdę wygodnego łóżeczka, przypomniał sobie, że mama nauczyła go kiedyś magicznego słowa, po wypowiedzeniu którego wszystkie mopsiki stają się odważne. Brzmiało ono...",
      "en": ""
    },

    "actions": [
      {
        "type": "input",
        "label": "Wpisz magiczne słowo dla mopsika",
        "saveInputAs": "magicPhrase",
        "linksTo": "bedroom-3"
      }
    ]
  },

  {
    "id": "bedroom-3",
    "scene": "bedroom",

    "title": {
      "pl": "Magiczne słowo Rondelki",
      "en": ""
    },

    "text": {
      "pl": "No okej, ${magicPhrase}, niech ci będzie. Od teraz Mopsik może przywoływać to słowo, ilekroć będzie tego potrzebował. Pamiętaj tylko, że magicznych słów należy używać z rozwagą.",
      "en": ""
    },

    "actions": [
      {
        "type": "link",
        "label": "Mopsik wstaje z łóżka",
        "saveInputAs": "",
        "linksTo": "bedroom-4"
      }
    ]
  },

  {
    "id": "bedroom-4",
    "scene": "bedroom",

    "title": {
      "pl": "Mopsik wstaje z łóżka",
      "en": ""
    },

    "text": {
      "pl": "Pokrzepiony tym wspomnieniem, Rondelko wyskoczył z łóżka i wylądował łapkami na czymś zimnym i wilgotnym. To z pewnością nie był puchaty dywan z jego pokoju. Nie zdążył się nawet nad tym zastanowić, bo ktoś za jego plecami powiedział: - No fajnie, fajnie, to chodź już teraz, drugą godzinę czekam, a nie mam całej nocy.",
      "en": ""
    },

    "actions": [
      {
        "type": "link",
        "label": "Mopsik zdaje się na instynkt",
        "saveInputAs": "",
        "linksTo": "bedroom-5-1"
      },
      {
        "type": "link",
        "label": "Mopsik zachowuje się jak dziecko, którym jest",
        "saveInputAs": "",
        "linksTo": "bedroom-5-2"
      },
      {
        "type": "link",
        "label": "Mopsik podchodzi do sprawy racjonalnie",
        "saveInputAs": "",
        "linksTo": "bedroom-5-3"
      }
    ]
  },

  {
    "id": "bedroom-5-1",
    "scene": "bedroom",

    "title": {
      "pl": "Mopsik zdaje się na instynkt",
      "en": ""
    },

    "text": {
      "pl": "Mopsik podskoczył ze strachu i zaczął uciekać. Przebierał krótkimi nóżkami jak w amoku. W brzuchu przewracały mu się smaczki, które zjadł przed snem, chociaż mama zawsze powtarzała, że nie wolno jeść po dobranocce. Kiedy już myślał, że udało mu się zgubić przeciwnika, usłyszał ten sam głos: - Rondelko, skup się, bo nie będę powtarzać. Stąd nie ma ucieczki, okej? Możesz biec i biec, aż porzygasz się ze zmęczenia, a ja będę zawsze za tobą. Przestań marnować mój czas.",
      "en": ""
    },

    "actions": [
      {
        "type": "link",
        "label": "Mopsik czuje urazę, bo nie rzygał nigdy ze zmęczenia",
        "saveInputAs": "",
        "linksTo": "bedroom-6-1"
      },
      {
        "type": "link",
        "label": "Mopsik jest tak zmęczony, że zaraz chyba naprawdę się porzyga",
        "saveInputAs": "",
        "linksTo": "bedroom-6-2"
      }
    ]
  },

  {
    "id": "bedroom-5-2",
    "scene": "bedroom",

    "title": {
      "pl": "Mopsik zachowuje się jak dziecko, którym jest",
      "en": ""
    },

    "text": {
      "pl": "Rondelko zaczął płakać. Najpierw nieśmiało, lecz z każdą sekundą coraz bardziej histerycznie. Z nosa leciały mu gluty, sierść na buzi zrobiła się cała mokra, a pod łapkami uformowała mu się całkiem spora kałuża. - Chryste, Rondelko, co ty wyprawiasz? Przepraszam, nie chciałam cię tak przestraszyć - usłyszał.",
      "en": ""
    },

    "actions": [
      {
        "type": "link",
        "label": "Mopsik smarka w lewy rękaw piżamy",
        "saveInputAs": "",
        "linksTo": "bedroom-6-3"
      },
      {
        "type": "link",
        "label": "Mopsik smarka w prawy rękaw piżamy",
        "saveInputAs": "",
        "linksTo": "bedroom-6-4"
      }
    ]
  },

  {
    "id": "bedroom-5-3",
    "scene": "bedroom",

    "title": {
      "pl": "Mopsik podchodzi do sprawy racjonalnie",
      "en": ""
    },

    "text": {
      "pl": "Chociaż był jeszcze dzieckiem, Rondelko postanowił zachować się jak dorosły mops. Wziął głęboki oddech i odwrócił się, żeby sprawdzić, kto za nim stoi. Jego oczom ukazał się szkielet. Był ubrany w czarny płaszcz, a przy boku trzymał kosę. Rondelkowe serce podskoczyło do gardła, a łapki zadrżały. - ${magicPhrase}!, ${magicPhrase}! - krzyknął Rondelko i po chwili poczuł przypływ odwagi. Zrozumiał, że musi jak najszybciej podjąć decyzję, co zrobić dalej.",
      "en": ""
    },

    "actions": [
      {
        "type": "link",
        "label": "Mopsik zagaduje i robi to głupio",
        "saveInputAs": "",
        "linksTo": "bedroom-6-5"
      },
      {
        "type": "link",
        "label": "Mopsik atakuje i robi to głupio",
        "saveInputAs": "",
        "linksTo": "bedroom-6-6"
      }
    ]
  }
]
